import time


ans_one = input("""
Год гангутского сражения?
1. 1733
2. 1714
3. 1721
4. 1713
""")
if ans_one == "2":
    print("Yes")
    ans_two = input("""
    Как быстро добраться до госпиталя?
    1. Встать по середине дороги
    2. На такси
    3. Пешком
    4. На автобусе
    """)
    if ans_two == "1" or "2":
        print("Yes")
        ans_tree = input("""
        Как зовут персонажа из аниме Re:zero
        1. Рио
        2. Субару
        3. Кэяру
        4. Белл
        """)
        if ans_tree == "2":
            print("Yes")
            ans_four  = input("""
            Cколько лет было пушкину когда он умер?
            1. 47
            2. 27
            3. 37
            4. 35
            """)
            if ans_four == "3":
                print("Yes")
                ans_five = input("""
                С какой скоростью летит пуля выпущенная из свд?
                1. 550 м/с
                2. 700 м/с
                3. 1000 м/с
                4. 830 м/с
                """)
                if ans_five == "4":
                    print("Yes")
                    ans_six = input("""
                    Сколько лет Братишкину?
                    1. 34
                    2. 26
                    3. 32
                    4. 21
                    """)
                    if ans_six == "2":
                        print("Yes")
                        ans_seven = input("""
                        Сколько лет Дипинсу?
                        1. 21
                        2. 24
                        3. 16
                        4. 18
                        """)
                        if ans_seven == "1":
                            print("Yes")
                            ans_eight = input("""
                            Сколько лет Бустеру?
                            1. 28
                            2. 27
                            3. 29
                            4. 33
                            """)
                            if ans_eight == "2":
                                print("Yes")
                                ans_nine  = input("""
                                Сколько дней игра "Escape From Tarkov" находится в бета тесте?
                                1. 2967 дней
                                2. 1867 дней
                                3. 2138 дней
                                4. 3985 дней
                                """)
                                if ans_nine == "3":
                                    print("Yes")
                                    ans_ten = input("""
                                    Какой патрон использует пулемёт "Утёс"?
                                    1. 12,7х108 мм
                                    2. 12,7х55 мм
                                    3. 12,7х99 мм
                                    4. 12,7х109 мм
                                    """)
                                    if ans_ten == "1":
                                        print("Yes")
                                    else:
                                        print("Вы победили и получили 1 Милион Рублей!!!")
                                else:
                                    print("Вы проиграли и получили 900к")
                            else:
                                print("Вы проиграли и получили 800к")
                        else:
                            print("Вы проиграли и получили 300к")
                    else:
                        print("Вы проиграли и получили 300к")
                else:
                    print("Вы проиграли и получили 300к")
            else:
                print("Вы проиграли и получили 300к")
        else:
            print("Вы проиграли и ничего не получили")
    else:
        print("Вы проиграли и ничего не получили")
else:
    print("Вы проиграли и ничего не получили")