import time
name = input("Здравствуйте! Введите ваше имя: ")
score = 0
true_answers = [ 2, 2, 2, 3, 4, 2, 1, 2, 3, 1 ]
print("""Мы вас приветствуем
      Вам будет задано 10 вопросов каждый из вопросов имеет 4 варианта ответа, и в основном только один будет верный.
      При неправильном ответе на фопрос игра немедленно завершится но у нас есть не сгораемые суммы.
      *После 3 верных ответов несгораемая сумма составит 300000 рублей
      *После 7 верных ответов несгораемая сумма составит 700000 рублей
      *При ответе на все вопросы правильно вы получите 1000000 рублей!!!""")
questions = [
    """
    Год гангутского сражения?
    1. 1733
    2. 1714
    3. 1721
    4. 1713""",
    """
    Как быстро добраться до госпиталя?
    1. Встать по середине дороги
    2. На такси
    3. Пешком
    4. На автобусе""",
    """
    Как зовут главного персонажа из аниме Re:zero?
    1. Рио
    2. Субару
    3. Кэяру
    4. Белл""",
    """
    Сколько лет было Пушкину, когда он умер?
    1. 47
    2. 27
    3. 37
    4. 35""",
    """
    С какой скоростью летит пуля, выпущенная из СВД?
    1. 550 м/с
    2. 700 м/с
    3. 1000 м/с
    4. 830 м/с""",
    """
    Сколько лет Братишкину?
    1. 34
    2. 26
    3. 32
    4. 21""",
    """
    Сколько лет Дипинсу?
    1. 21
    2. 24
    3. 16
    4. 18""",
    """
    Сколько лет Бустеру?
    1. 28
    2. 27
    3. 29
    4. 33""",
    """
    Сколько дней игра "Escape From Tarkov" находится в бета-тесте?
    1. 2964 дней
    2. 5869 дней
    3. 2733 дней
    4. 1985 дней""",
    """
    Какой патрон использует пулемёт "Утёс"?
    1. 12,7х108 мм
    2. 12,7х55 мм
    3. 12,7х99 мм
    4. 12,7х109 мм"""
]
for i, question in enumerate(questions):
    print(f"Вопрос {i + 1}:")
    print(question)
    while True:
        try:
            answer = int(input("Ваш ответ (1-4): "))
            if answer not in [1, 2, 3, 4]:
                print("Введите число от 1 до 4.")
            else:
                break
        except ValueError:
            print("Введите число от 1 до 4.")
    if answer == true_answers[i]:
        print("Правильно!")
        score += 1
    else:
        print(f"Неправильно! Вы ошиблись на {i+1}-м вопросе.")
        break
if score == 3:
    print("Вы достигли несгораемой суммы 300,000 рублей!")
elif score == 7:
    print("Вы достигли несгораемой суммы 700,000 рублей!")
elif score == 10:
    print("Поздравляем! Вы выиграли 1,000,000 рублей!")
else:
    print("Попробуйте снова!")