import time

user_name = input("Как вас зовут? ")
artefact_cyan = False
artefact_red = False
artefact_white = False
points = 0
print(f"Приветствую {user_name}")
print(f"""Ты хочешь попасть в рай тогда тебе здесь нужно отыскать три артифакта и ты сможешь вставить их во врата и попасть в рай.
      Чтож {user_name} у тебя нету стартового капитала что равняется {points}. Ну раз у тебя нету денег тебе делать больше нечего и я тебя отправляю в Dunge.
      Так для начала расскажу про сам Dunge это место где ты за правильные ответы на вопросы будешь получать доступ к комнатам с сокровищами, награда зависит от сложности.
      Вы в переместились в Dunge перед вами коридор с несколько дверей и табличкой надпись на которой гласит:
                         |Путник ты сейчас находишься в коридоре дверей преисподни!|
                                    |За верный ответ дверь откроется|
                              |За неверный ты переместишся в преисподнию|  """)
time.sleep(1)
answer_one = input("""Вы входите в первую дверь и видите первую табличку с вопросом:
               Два медвежонка нашли головку сыра. Они долго спорили, как ее поделить, но никто не
               хотел уступать. Мимо пробегала лиса. Узнав, о чем спор, она предложила помочь,
               разломив головку сыра на 2 части так, чтобы одна из них была полкилограмма, а другая
               меньше. Затем она спросила, усмехаясь: Куски равны? Жадные медвежата дали
               отрицательный ответ. Тогда лиса откусила от большей части, но так, чтобы от нее остался
               кусок меньше, чем другая часть, и повторила вопрос. И на этот раз медвежата сообщили,
               что получились неравные части. После этого лиса повторила откусывание еще 9 раз,
               каждый раз откусывая одинаковое количество сыра. В результате остались маленькие
               кусочки, причем один из них оказался на 20 граммов больше другого. Лиса заявила, что
               медвежатам трудно угодить. Она отправила оба кусочка в рот и, вильнув хвостом,
               скрылась в кустах. Какова была масса головки сыра в граммах?
               """)
if answer_one == "980":
    artefact_cyan = True
    points += 15
    print("Вы дали верный ответ получили 15 монет и прошли дальше забрав голубой артефакт")
else:
    print("Вы не отгодали но дверь открылась")
answer_two = input("Сколько корней имеет уравнение sin(8x)/cos(5x)=1 на отрезке [0,2010π]? \n")
if answer_two == "14070":
    artefact_red = True
    points += 25
    print("Вы наверное посчитали и получили 25 монет с красным артефактом")
else:
    print("Вы ответили неверно но прошли дальше")
print(f"{points}")
answer_tree = input("Сколько лет основателю копмании BSG? \n")
if answer_tree == "37":
    points += 30
    artefact_white = True
    print("Вы ответили верно и получили 30 монет и также белый артефакт")
else:
    print("Вы не смогли ответить на этот вопрос но прошли дальше")
market = input("""Вы вышли к рынку где можете купить только один предмет
             1. Святая вода 5 монет
             2. Меч полукровки 15 монет
             3. Маска демона 25 монет
             4. Мороженное 1 монета
             5. Уйти
             """)
if market == "1" and points >= 5:
    points -= 5
    print("Вы приобрели свютую воду")
elif market == "2" and points >= 15:
    points -= 15
    print("Вы приобрели меч полукровки")
elif market == "3" and points >=25:
    points -= 25
    print("Вы приобрели маску демона")
elif market == "4" and points >= 1:
    points -= 1
    print("Вы приобрели мороженное")
elif market == "5":
    print("Вы просто ушли")
else:
    print("У вас недостаточно средств")
time.sleep(3)
if artefact_cyan and artefact_red and artefact_white:
    print(f"Вы победили раздобыли все артефакты и заработали {points} монет в итоге попав в Рай")
elif artefact_cyan and artefact_red:
    print(f"Ты заполучил два артифакта голубой и красный заработав {points}") 
elif artefact_red and artefact_white:
    print(f"Вы раздобыли только красный и белый артефакт заработав {points} монет")
elif artefact_cyan and artefact_white:
    print(f"Вы раздобыли голубой и белый артефакты  а так же заработали {points} монет")
elif artefact_red or artefact_cyan or artefact_white:
    print(f"Вы раздобыли только один артефакт и заработали {points} монет")
else:
    print("Вы несмогли получить артефакты и незаработали ни единой монеты")